Revit 2027 API
FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) Constructor
 Creates a new instance of the FabricationPartSizeMap class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationPartSizeMap(
	string size,
	double widthDiameter,
	double depth,
	bool isProductList,
	ConnectorProfileType profileType,
	int serviceId,
	int paletteId
)
Public Sub New (
	size As String,
	widthDiameter As Double,
	depth As Double,
	isProductList As Boolean,
	profileType As ConnectorProfileType,
	serviceId As Integer,
	paletteId As Integer
)
public:
FabricationPartSizeMap(
	String^ size,
	double widthDiameter,
	double depth,
	bool isProductList,
	ConnectorProfileType profileType,
	int serviceId,
	int paletteId
)
new :
        size : string *
        widthDiameter : float *
        depth : float *
        isProductList : bool *
        profileType : ConnectorProfileType *
        serviceId : int *
        paletteId : int -> FabricationPartSizeMap
Parameters
size String
 The size display string for the straight that can be used by the user interface.
widthDiameter Double
 The width or diameter of the straight.
depth Double
 The depth of the straight.
isProductList Boolean
 Set if the straight a product list or not.
profileType ConnectorProfileType
 Set the shape of the straight.
serviceId Int32
 Set the service identifier of the straight.
paletteId Int32
 Set the palette identifier of the straight.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricationPartSizeMap Class
FabricationPartSizeMap Overload
Autodesk.Revit.DB.Fabrication Namespace